### Import the library pandas as pd

#### Import արեք pandas գրադարանը pd  անունով

In [1]:
import pandas as pd

### Import the dataset gender.txt, assign to a variable gender

### Import արեք gender.txt dataset-ը, վերագրեք այն gender փոփոխականին

In [59]:
gender = pd.read_csv(r'C:\Users\HP\Desktop\IrinaSargsyanHW\Python\HW\HW.pandas2\gender.txt', sep='|', index_col = 'user_id')

In [60]:
gender

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Check the datatypes in the dataframe

### Ստուգեք աղյուսակի սյուների տիպերը

In [4]:
gender.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Convert the datatype of the column 'occupation' into categorical

### Վերածեք 'occupation' սյունը categorical տիպի

In [7]:
gender['occupation'] = gender['occupation'].astype('category')

In [8]:
gender.dtypes

age              int64
gender          object
occupation    category
zip_code        object
dtype: object

### Replace the values in the column 'gender' with Male and Female accordingly. Do this with 2 methods: using apply and map.

### Փոխարինեք  'gender' սյան արժեքները Male և Female արժեքներով, արեք սա երկու տարբերակով՝ գործածելով apply և map ֆունկցիաները

In [61]:
gender['gender'] = gender['gender'].map({'M': 'Male', 'F': 'Female'})

In [62]:
gender

         age  gender     occupation zip_code
user_id
1         24    Male     technician    85711
2         53  Female          other    94043
3         23    Male         writer    32067
4         24    Male     technician    43537
5         33  Female          other    15213
...      ...     ...            ...      ...
939       26  Female        student    33319
940       32    Male  administrator    02215
941       20    Male        student    97229
942       48  Female      librarian    78209
943       22    Male        student    77841

[943 rows x 4 columns]

In [17]:
def func1(val):
    if val == "M":
        return "Male"
    else:
        return "Female"

In [18]:
gender['gender'] = gender['gender'].apply(func1)

In [19]:
gender

         age  gender     occupation zip_code
user_id
1         24    Male     technician    85711
2         53  Female          other    94043
3         23    Male         writer    32067
4         24    Male     technician    43537
5         33  Female          other    15213
...      ...     ...            ...      ...
939       26  Female        student    33319
940       32    Male  administrator    02215
941       20    Male        student    97229
942       48  Female      librarian    78209
943       22    Male        student    77841

[943 rows x 4 columns]

### Calculate the mean, median and std of age values for each occupation

### Հաշվեք age սյան mean, median և std արժեքները occupation սյան ամեն արժեքի համար

In [25]:
grouped = gender.groupby('occupation')

In [26]:
import numpy as np
x = grouped['age'].agg([np.mean, np.median, np.std])
x

                    mean  median        std
occupation
administrator  38.746835    37.0  11.123397
artist         31.392857    30.0   8.668116
doctor         43.571429    45.0  12.501428
educator       42.010526    42.0  10.413264
engineer       36.388060    36.0  11.199236
entertainment  29.222222    25.0  10.056052
executive      38.718750    38.5  10.608075
healthcare     41.562500    44.5  11.313524
homemaker      32.571429    32.0  10.737119
lawyer         36.750000    34.0  10.830303
librarian      40.000000    39.0  11.023611
marketing      37.615385    36.0   9.474500
none           26.555556    26.0  13.757826
other          34.523810    32.0  10.738227
programmer     33.121212    30.0   9.624512
retired        63.071429    63.0   5.757461
salesman       35.666667    34.0  14.079859
scientist      35.548387    37.0   7.392964
student        22.081633    21.0   5.284081
technician     33.148148    30.0   9.867210
writer         36.311111    36.0  11.423306

### Create a new column 'birth_year' and get the birth year of each individual using the values from the column 'age'

### Ստեղծեք 'birth_year' անունով նոր սյուն, որում կպահեք ամեն մարդու ծննդյան տարին, որը կստանաք օգտագործելով 'birth_year' սյան արժեքները

In [63]:
from datetime import date
today = date.today()
gender['birth_year'] = today.year - gender['age']

In [64]:
gender

         age  gender     occupation zip_code  birth_year
user_id
1         24    Male     technician    85711        1997
2         53  Female          other    94043        1968
3         23    Male         writer    32067        1998
4         24    Male     technician    43537        1997
5         33  Female          other    15213        1988
...      ...     ...            ...      ...         ...
939       26  Female        student    33319        1995
940       32    Male  administrator    02215        1989
941       20    Male        student    97229        2001
942       48  Female      librarian    78209        1973
943       22    Male        student    77841        1999

[943 rows x 5 columns]

### Create a new column 'birth_date' using the column 'birth_year' and current month and day values"

### Ստեղծեք 'birth_date' անունով նոր սյուն, որի արժեքները կստանաք գործածելով 'birth_year' սյան արժեքները ինչպես նաև այս պահի ամիսն ու օրը։

In [69]:
gender['birth_date'] = gender['birth_year'].astype(str) + '/' + str(today.month) + '/' + str(today.day)

In [70]:
gender

         age  gender     occupation zip_code  birth_year birth_date
user_id
1         24    Male     technician    85711        1997   1997/5/1
2         53  Female          other    94043        1968   1968/5/1
3         23    Male         writer    32067        1998   1998/5/1
4         24    Male     technician    43537        1997   1997/5/1
5         33  Female          other    15213        1988   1988/5/1
...      ...     ...            ...      ...         ...        ...
939       26  Female        student    33319        1995   1995/5/1
940       32    Male  administrator    02215        1989   1989/5/1
941       20    Male        student    97229        2001   2001/5/1
942       48  Female      librarian    78209        1973   1973/5/1
943       22    Male        student    77841        1999   1999/5/1

[943 rows x 6 columns]

### Make sure the datatype of the columns 'birth_year' and 'birth_date' is datetime

### Վստահ եղեք, որ 'birth_year' և 'birth_date' սյուները datetime տիպի են

In [82]:
gender['birth_year'] = pd.to_datetime(gender['birth_year'], utc=True)
gender['birth_date'] = pd.to_datetime(gender['birth_date'], utc=True)

In [83]:
gender.dtypes

age                         int64
gender                     object
occupation                 object
zip_code                   object
birth_year    datetime64[ns, UTC]
birth_date    datetime64[ns, UTC]
dtype: object

### Change the values in the column user_id to have the values of type string of the same length (use the method of your choice). As an example, if we have values 0, 1 and 100, we could have values '000', '001' and '100' as a result.

### Փոխեք user_id սյան արժեքները նույն երկարություն ունեցող string տիպի արժեքներով՝ գործածելով Ձեր ցանկացած մեթոդը։ Որպես օրինակ, եթե ունեք 0, 1 և 100 աևժեքներ, Ձեր արդյունքը կարող է լինել '000', '001' և'100'

In [90]:
gender[gender.columns[0]].apply(lambda row: '0' * (3 - len(str(row))) + str(row))

user_id
1      024
2      053
3      023
4      024
5      033
      ...
939    026
940    032
941    020
942    048
943    022
Name: age, Length: 943, dtype: object

In [88]:
gender['user_id']

KeyError: 'user_id'

In [92]:
gender['user_id'].apply(lambda row: '0' * (3 - len(str(row))) + str(row))

KeyError: 'user_id'